Ran Plan for project: `my-infrastructure` dir: `diplom/main` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # local_file.hosts_templatefile will be created
+ resource "local_file" "hosts_templatefile" {
      + content              = <<-EOT
            [kube_control_plane]
            master1 ansible_host=192.168.1.11    ip=192.168.1.11  etcd_member_name=etcd1
            master2 ansible_host=192.168.2.22    ip=192.168.2.22  etcd_member_name=etcd2
            master3 ansible_host=192.168.3.33    ip=192.168.3.33  etcd_member_name=etcd3
            
            [etcd:children]
            kube_control_plane
            
            [calico_rr]
            
            [k8s_cluster:children]
            kube_control_plane
            calico_rr
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0644"
      + filename             = "/atlantis-data/repos/dreadsolnce/netology_courses/37/default/diplom/main/hosts.ini"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
~ Абсолютный_путь                                              = {
      ~ abspath = "/home/kvl/netology_courses/diplom/main" -> "/atlantis-data/repos/dreadsolnce/netology_courses/37/default/diplom/main"
        # (1 unchanged attribute hidden)
    }
~ Основные_скрипты_запуска                                     = {
      ~ file_app        = "/home/kvl/netology_courses/diplom/main/conf/app/app.sh" -> "/atlantis-data/repos/dreadsolnce/netology_courses/37/default/diplom/main/conf/app/app.sh"
      ~ file_kubespray  = "/home/kvl/netology_courses/diplom/main/conf/kubespray/kubespray.sh" -> "/atlantis-data/repos/dreadsolnce/netology_courses/37/default/diplom/main/conf/kubespray/kubespray.sh"
      ~ file_prometheus = "/home/kvl/netology_courses/diplom/main/conf/grafana/kube-prometheus.sh" -> "/atlantis-data/repos/dreadsolnce/netology_courses/37/default/diplom/main/conf/grafana/kube-prometheus.sh"
    }
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p my-infrastructure
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.kvlpro.site:30141/lock?id=dreadsolnce%252Fnetology_courses%252Fdiplom%252Fmain%252Fdefault%252Fmy-infrastructure)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p my-infrastructure
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```